//Какие недостатки вы видите в стиле написания кода этого примера?
//     function pow(x,n)                     //большой отступ пробел между параметрами
//     {                                    //фигурная скобка на слуд строке
//         let result=1;
//         for(let i=0;i<n;i++) {result*=x;} //пробел после for. пробел вокруг операторов, тело цикла на обной строке
//         return result;
//     }
//
//     let x=prompt("x?",''), n=prompt("n?",'')//пробел вокруг операторов, точка с запятой
// if (n<=0)                                 //пробел вокруг операторов,
// {
//     alert(`Степень ${n} не поддерживается, введите целую степень, большую 0`);// длинная строка
// }
// else
// {
//     alert(pow(x,n))         //точка с запятой, порбелы
// }


function pow(x, n) {
    let result = 1;

    for (let i = 0; i < n; i++) {
        result *= x;
    }

    return result;
}

let x = prompt("x?", '');
let n = prompt("n?", '');
if (n <= 0) {
    alert(`Степень ${n} не поддерживается,
     введите целую степень, большую 0`);
} else {
    alert( pow(x, n));
}

pow(2, 3);

module.exports = pow;