/*Вычислить факториал
важность: 4
Факториал натурального числа – это число, умноженное на "себя минус один", затем на "себя минус два", и так далее до 1. Факториал n обозначается как n!

Определение факториала можно записать как:

n! = n * (n - 1) * (n - 2) * ...*1
Примеры значений для разных n:

1! = 1
2! = 2 * 1 = 2
3! = 3 * 2 * 1 = 6
4! = 4 * 3 * 2 * 1 = 24
5! = 5 * 4 * 3 * 2 * 1 = 120
Задача – написать функцию factorial(n), которая возвращает n!, используя рекурсию.

alert( factorial(5) ); // 120
P.S. Подсказка: n! можно записать как n * (n-1)! Например: 3! = 3*2! = 3*2*1! = 6

 */

function f(n, a=0) {//если параметр а не задан, то а=0
        a++;
    if (a < n) {
        a *= f(n, a)//тут а уже не undefined, вызываем рекурсию с двумя параметрами
    }
    return a
}

console.log(f(6))


// function f(n) {
//     let a = 1
//     while (n){
//         a *= n--
//     }
//
//     return a
// }
//
// console.log(f(6))