/*Числа Фибоначчи
 важность: 5
 Последовательность чисел Фибоначчи определяется формулой Fn = Fn-1 + Fn-2. То есть, следующее число получается как сумма двух предыдущих.

 Первые два числа равны 1, затем 2(1+1), затем 3(1+2), 5(2+3) и так далее: 1, 1, 2, 3, 5, 8, 13, 21....

 Числа Фибоначчи тесно связаны с золотым сечением и множеством природных явлений вокруг нас.

 Напишите функцию fib(n) которая возвращает n-е число Фибоначчи.

 Пример работы:

 function fib(n) {  }

alert(fib(3)); // 2
alert(fib(7)); // 13
alert(fib(77)); // 5527939700884757
P.S. Все запуски функций из примера выше должны работать быстро. Вызов fib(77) должен занимать не более доли секунды.*/

//на рекурсии
// function fib(n) {
//     if(n<3){
//         return 1
//     }
//     return fib(n-1)+fib(n-2)
//
// }
//
// console.log(fib(8))


// на циклах
function fibCycle(n) {
    let fib1 = 0;
    let fib2 = 1;
    let fib3 = 1;
    for (let i = 1; i < n; i++) {
        fib3 = fib1 + fib2;
        fib1 = fib2;
        fib2 = fib3;
    }
    return fib3

}

console.log(fibCycle(77))